Table of Contents
 Class PolyLine3D
Namespace
IdeaRS.OpenModel.Geometry3D
Assembly
IdeaRS.OpenModel.dll
Represents a polyline in three-dimensional space.
[OpenModelClass("CI.Geometry3D.PolyLine3D,CI.Geometry3D", "CI.Geometry3D.IPolyLine3D,CI.BasicTypes")]
public class PolyLine3D : OpenElementId
Inheritance
object
OpenObject
OpenElementId
PolyLine3D
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 PolyLine3D()
Contructor
public PolyLine3D()
Properties
 Segments
Gets or sets list of references to Segment3D of PolyLine3D.
public List<ReferenceElement> Segments { get; set; }
Property Value
List<ReferenceElement>
 Edit this page